/****** 变量定义 ******/
const html = document.documentElement;
const header_midTop_bottom_special_hotWords = ["生鲜大狂欢", "家电双十二", "工业年末庆", "兰雀进口奶"];
let countHotWords = header_midTop_bottom_special_hotWords.length;
const header_midTop_bottom_placeholder = ["游戏主机", "颈椎按摩器", "美的饮水机", "笔记本固态硬盘", "黄金手链", "电动滑板车", "电脑数码 万件5折天天抢", "互联网电视", "磁力片", "自营电脑 限量5折秒杀"];
let countPlaceWords = header_midTop_bottom_placeholder.length;
const selectTopNavLeftSliderItems = $(".topNav_mid_left_slider_item");
let countTopNavLeftSliderItems = selectTopNavLeftSliderItems.length;
let topNavLeftSliderItemPosition = 0;
const selectTopNavRightSliderList = $(".topNav_mid_slider_right_slider_list");
let countTopNavRightSliderList = selectTopNavRightSliderList.length;
let topNavRightSliderItemPosition = 0;
const selectSecondKillRightSliderItems = $(".secondKill_right_item");
let countSecondKillRightSliderItems = selectSecondKillRightSliderItems.length;
let secondKillRightSliderPosition = 0;
const selectTopNavRightBottomContainerItemImg = document.getElementsByClassName("topNav_right_bottom_container_item_img");
let countTopNavRightBottomItemImg = selectTopNavRightBottomContainerItemImg.length;
const selectChannelSquareInnerItemBottomImg = document.getElementsByClassName('channelSquare_inner_item_bottom_img');
let beforeScroll = 0;
let recommendAlreadyShow = 0;
let changeDuration = 3000;
let secondKillMidAnimationDuration = 400;
const secondKill = document.querySelector('.secondKill');

const brand = document.querySelector(".brand");
const selectEverydayDiscountList = $(".everydayDiscount_list");
const everydayDiscountChildItem = '<div class="everydayDiscount_item"><div class="everydayDiscount_item_show"><img src="" alt="" class="everydayDiscount_item_img"><div class="everydayDiscount_item_days"></div></div><div class="everydayDiscount_item_information"><div class="everydayDiscount_item_information_title"></div><div class="everydayDiscount_item_information_price"><div class="everydayDiscount_item_information_priceKill"></div><div class="everydayDiscount_item_information_priceOrigin"></div></div></div></div>';
let everydayDiscountContainer = {
  "choice": {
    1: ["95", "华晨宇代言养生堂保湿面膜6片", "99", "146"],
    2: ["188", "梦美斯宣 沙发 真皮沙发", "3775", "5720"],
    3: ["103", "买一送一 加绒加厚羊羔绒裤子", "67.3", "128"],
    4: ["39", "【冬季热卖】时尚潮流短靴男", "59", "168"],
    5: ["284", "加厚水貂绒针织衫", "59", "99"],
  },
  "food": {
    1: ["255", "第2件9.9元 广西皇帝柑 5斤装", "15.9", "35"],
    2: ["183", "网红脆锅巴米麻辣味2罐", "17.9", "29.8"],
    3: ["267", "储山新鲜砀山黄桃罐头425g*3罐", "15.8", "45"],
    4: ["168", "正宗江西遂川风干板鸭一只", "41.5", "59.9"],
    5: ["23", "阿克苏冰糖心苹果 净果2.5kg", "26.9", "59.9"],
  },
  "grocery": {
    1: ["253", "吸水地垫浴室防滑脚垫40*60cm", "15", "21.6"],
    2: ["254", "暖宫腰带大姨妈神器", "69", "168"],
    3: ["21", "伯朗森尤克里里演出专用背带", "28", "36"],
    4: ["282", "汉世刘家 摇盖垃圾桶家用12L", "12.9", "29.9"],
    5: ["352", "宜兴原矿手工紫砂茶叶罐", "58", "99"],
  },
  "nurse": {
    1: ["254", "鸡眼通通解决除根不反复", "22.8", "68"],
    2: ["62", "男士喷剂外用男用男士喷雾", "79", "118"],
    3: ["301", "北京同仁堂牙膏留兰香型10支", "28", "45.8"],
    4: ["53", "威露士健康抑菌洗手液480ml*4", "39.9", "69.9"],
    5: ["34", "【南京同仁堂】泡脚药包", "58", "89"],
  },
  "predict": {
    1: ["23", "3瓶 24K黄金色烟酰胺原液", "19.9", "29.9"],
    2: ["12", "闪迪32G高速U盘金属定制刻字", "25.9", "49"],
    3: ["45", "5双装宝宝加厚秋冬毛圈棉袜子", "19.99", "39.9"],
    4: ["63", "年抛彩色隐形眼镜两副4片", "61", "69"],
    5: ["46", "秋冬男士轻薄羽绒服外套", "87.8", "168"],
  }
}

const channelSquare = document.querySelector(".channelSquare");

const selectRecommendForYouList = document.querySelector('.recommendForYou_container_list');
const selectRecommendForYouContainer = document.querySelector('.recommendForYou_container');
const recommendForYouChildItem = '<div class="recommendForYou_container_item"><img src="" alt="" class="recommendForYou_container_item_img"><div class="recommendForYou_container_item_information"><div class="recommendForYou_container_item_information_text"></div><div class="recommendForYou_container_item_information_price"></div></div></div>';
let recommendContainer = {
  "like": {
    1: ["半山农 冬虫夏草 西藏那曲高海拔虫草 精选品质 3条/克 1克盒装 干度足无断草", "238."],
    2: ["穿腰绳神器家用免穿针手工缝衣针不用穿线的针 盲人针老人针免穿线针手缝针 图片色", "12."],
    3: ["新品指纹解锁14英寸轻薄金属笔记本电脑办公大学生女生款便携本超薄超级本手提 英特尔十代四核J4115 8G内存 256G固态 微边框IPS全面屏", "2399."],
    4: ["北欧ins风客厅沙发茶几毯轻奢地毯 家用卧室铺满床边防滑 海岛的奢华 140*200cm", "469."],
    5: ["健长贴增l长曾高贴青少年成人足贴磁疗贴长增个 三盒疗程装", "258."],
    6: ["穿腰绳神器松紧带穿带器穿引器穿针器夹子穿松紧器穿绳器裤子橡筋工具穿引针 圆+扁穿带器各一个", "15."],
    7: ["骆驼（CAMEL） 运动鞋男复古百搭透气休闲男潮鞋 A942363790 驼色 43", "215."],
    8: ["车载手机支架汽车用出风口卡扣式重力支撑导航架创意可爱车用支驾 笑脸-电光银", "119."],
    9: ["摩尔古迪（MOOREGOOD）羽绒服短款男2020保暖上衣潮流工装口袋连帽加厚羽绒外套 黑色 XL 定金拍下补尾款", "1899."],
    10: ["新款蚊帐拉链蒙古包公主风1.5米1.8m床双人家用儿童防摔支架纹帐 蓝绿色 1.2m(4英尺）床", "329."],
    11: ["Next Level Racing GT track 赛车游戏座椅 方向盘支架VR游戏座椅电竞舱电竞椅游戏机模拟器", "5999."],
    12: ["海马床垫 泰国天然进口乳胶 1.8 1.5m 1.2米床双人软硬两用可定制独立弹簧椰棕乳胶床垫席梦思 防螨B:天然乳胶+独立弹簧+3E棕 两用23厘米 1500*1900", "1258."],
    13: ["【当季精选】红盒德盛旋 电脑平车头 自动剪线梭床缝纫机配件", "125."],
    14: ["稻草人（MEXICAN）休闲裤男加绒加厚2020冬季韩版修身小脚裤男士羊羔绒运动长裤 黑色 4XL", "79."],
    15: ["便携式车载冰箱10L车家两用迷你小冰箱宿舍办公室制冷牛奶冷藏箱 冰箱【10L蓝白色】", "369."],
    16: ["集成灶蒸烤一体 蒸箱烤一体 蒸箱烤箱消毒柜 自动清洗家用油烟机燃气灶套装环保灶威士伯 90CM蒸烤消一体 液化气", "4790."],
    17: ["四季通用汽车坐垫 菱形格子5D立体全包围座垫套 纯黑色标准版", "449."],
    18: ["南极人 10双装 秋冬季女士袜子女袜 可爱熊日系长筒袜女ins风纯色棉袜保暖运动袜网红女堆堆潮 均码", "30."],
    19: ["德国家用快速磨刀神器磨刀石棒磨菜刀厨房小工具魔刀棍摩刀 三孔磨刀器(送手指卫士)", "50."],
    20: ["神农百草膏牛皮银屑癣病顽固成人湿疹皮肤瘙痒百草止痒膏阴囊股癣藓膏大腿内侧真菌克星紫椒癣立净癣酊手足癣", "58."],
  },
  "electric": {
    1: ["Redmi Note 9 Pro 5G 一亿像素 骁龙750G 33W快充 120Hz刷新率 碧海星辰 6GB+128GB 游戏智能手机 小米 红米", "1599."],
    2: ["中国移动 移动流量卡4g手机卡大王卡手机号电话卡日租不限速无限纯流量上网卡 （遁天卡）18元/月年享756G流量1200分钟", "19."],
    3: ["帮帮机D1错题打印机 作业帮2.5亿题库学生错题整理神器家用迷你便携标签手账多功能热敏打印机 白", "159."],
    4: ["黑鲨电竞指套 无断触达 吃鸡和平精英王者荣耀 触摸屏游戏防汗手指套 2只装", "29."],
    5: ["Redmi Note 9 4G 6000mAh大电池 骁龙662处理器 18W快充 羽墨黑 4GB+128GB 游戏智能手机 小米 红米", "999."],
    6: ["Redmi手环 黑色 彩屏心率运动手环50米防水24小时高精度心率监测", "100."],
    7: ["【二手95新】英伟达技嘉微星（MSI）GeForce GTX1080 Ti 11G 暗黑龙爵游戏显卡 微星（MSI）GTX 1050Ti 4G 红龙", "788."],
    8: ["苏泊尔 (SUPOR) JZT-Q5燃气灶5.0KW大火力嵌入式台式两用家用双灶 钢化玻璃 全进风 （天然气）", "549."],
    9: ["艾修 数据线三合一手机充电器线一拖三手机快充多头适用华为苹果iphone安卓通用type-c车载 1.2米红色", "11."],
    10: ["360行车记录仪 G300pro 1296p高清 迷你隐藏 微光夜视 无线测速电子狗一体 黑灰色", "349."],
    11: ["苏泊尔（SUPOR）电饼铛家用 双面加热 煎饼铛 煎烤机烙饼锅三明治机25mm加深烤盘早餐机 JJ30A648", "99."],
    12: ["诺基亚 NOKIA 220 4G 移动联通电信三网4G 蓝色 直板按键 双卡双待 备用功能机 老人老年手机 学生备用机", "279."],
    13: ["漫步者（EDIFIER）MiniBuds 真无线蓝牙耳机 音乐耳机 迷你运动耳机 手机耳机 通用苹果安卓手机 雾霾蓝", "199."],
    14: ["索爱（soaiy）SA-A6 音箱音响电脑手机多媒体台式机笔记本低音炮音响便携迷你音响", "69."],
    15: ["OPPO Ace2 8+128 月岩灰 高通骁龙865 双模5G 185g超薄机身 65W超级闪充 40W无线闪充 90Hz电竞屏", "2898."],
    16: ["小熊（Bear）电饭煲电饭锅小3升迷你智能预约定时保温2-6人 3L蒸饭器DFB-P30R3", "179."],
    17: ["Apple iPhone 12 Pro Max(A2412) 256 GB 海蓝色 支持移动联通电信5G 双卡双待手机", "10099."],
    18: ["电脑摄像头小三角架 三角支架 桌面小三角架", "20."],
    19: ["腾讯黑鲨游戏手机3 8GB+128GB 铠甲灰 骁龙865 270Hz触控采样率 “三明治”液冷散热 90Hz屏幕刷新率 双模5G", "2999."],
    20: ["美的（Midea）台灯led灯寝室宿舍卧室床头灯创意智能充电时钟闹钟小夜灯橙", "99."],
  },
  "life": {
    1: ["全款 道奇公羊1500 【新车汽车买车整车皮卡平行进口车】 黑色 2018款长角号", "375000."],
    2: ["振德（ZHENDE）KN95口罩一次性使用口罩PM2.5防雾霾口罩自吸过滤式坊颗粒物呼吸器 3只/1袋 非独立包装", "14."],
    3: ["赛仁 医用隔离面罩 防护面屏 防灰防尘防飞沫防液体喷溅 全脸防护 高清透光 大屏保护面罩", "22."],
    4: ["忍者（storc）指甲刀套装指甲剪指甲钳修甲不锈钢修脚刀套装耳勺商务活动年会纪念品", "27."],
    5: ["悦卡洗车拖把 汽车掸子刷车刷子软毛不伤车擦车工具用品 升级款雪尼尔可伸缩长杆洗车刷(蓝色)", "35."],
    6: ["糖米（Temi）儿童玩具积木桌子 抖音同款大颗粒多功能幼儿园学习桌椅男女孩3-6岁 2椅4桶+180大80大滑道", "198."],
    7: ["福东海 宁夏枸杞 罐装500g 苟杞子宁夏枸杞子 家庭装 红枸杞茶", "39."],
    8: ["得力(deli)0.5mm金属旋转中性笔签字笔 银DL-S99", "15."],
    9: ["双枪（Suncha）筷子家用合金筷子 防霉防滑耐高温 创意日式尖头筷子餐具套装 分食筷人物款5双装 SK20504", "30."],
    10: ["360行车记录仪 G300pro 1296p高清 迷你隐藏 微光夜视 无线测速电子狗一体 黑灰色", "349."],
    11: ["可么多么 (COMOTOMO) 新生儿婴儿 宽口径硅胶断奶奶瓶奶嘴（0-6个月）原装进口大小套装", "285."],
    12: ["四季沐歌 MICOE 淋浴增压花洒喷头套装 加压单手持花洒卫浴莲蓬头M-HS104", "37."],
    13: ["雅高 抹布 厨房魔力去污布 5片装 加厚双面洗碗布多功能百洁布", "12."],
    14: ["乐益 (leeioo)车载手机支架汽车通用手机导航支架重力感应吸盘粘黏中控台金属手机支架如意折叠款【商务黑】", "39."],
    15: ["定金 沃尔沃XC60 常规购车【新车汽车买车SUV】 全系车型", "99."],
    16: ["森森（SUNSUN）HE480森森超白玻璃小鱼缸客厅 小型桌面家用水族箱 生态免换水金鱼缸", "318."],
    17: ["HUAWEI 原装Mate40 RS保时捷设计 真皮翻盖保护套手机壳（玄黑）", "1899."],
    18: ["康恩贝 维生素c vc 咀嚼片维c 补充VC 成人 1.2g*100片", "20."],
    19: ["九洲鹿 毛毯法兰绒毯子 珊瑚绒午睡盖毯冬季床单单件 150*200cm雾霾蓝色", "39."],
    20: ["雅高 扫把簸箕套装家用仿猪鬃毛软毛笤帚扫帚", "17."],
  },
  "store": {
    1: ["掌护医用口罩成人三层透气灭菌防护一次性医疗口罩盒装50片", "20."],
    2: ["百家好世 免手洗平板拖把办公室木地板懒人擦地墩布自动回弹家用吸水托地把除尘清洁拖地神器 共3块布", "22."],
    3: ["海底捞 番茄牛肉 冲泡粉丝 懒人食品早餐夜宵酸辣粉方便速食米线零食119g", "12."],
    4: ["美的（Midea）电饼铛家用双面加热煎烤机烙饼机三明治早餐机蛋饼机薄饼机煎饼烙饼锅JHN30F", "89."],
    5: ["Tatanice儿童蘑菇钉玩具插板拼图创意玩具幼儿3-6岁男孩女孩玩具", "20."],
    6: ["尚烤佳 电烧烤炉 烧烤炉 电烤炉 电烤盘 火锅烧烤一体机 烤串机 全分体电火锅 LZW-1902", "299."],
    7: ["康师傅方便面大食袋红烧牛肉面袋面泡面五连包休闲零食", "15."],
    8: ["川珍 豆腐皮 200g 油豆皮腐竹干豆皮干货特产豆制品火锅食材凉拌麻辣烫", "11."],
    9: ["美的（Midea）取暖器/电暖器/电暖气片家用 节能省电 静音加湿烘衣 13片大面积劲暖电热油汀NY2513-16JW", "299."],
    10: ["金龙鱼 长粒香大米 东北大米 臻选长粒香大米2.5kg", "22."],
    11: ["moondog城市主题积木168粒幼儿童玩具木制质婴儿宝宝男孩女孩拼装拼图 1-2-3岁智力启蒙大颗粒桶装", "79."],
    12: ["袋鼠医生口罩医用外科口罩一次性【无菌级】成人男女通用 10只/包 3层无菌挂耳", "20."],
    13: ["四季粮票 熟冻北极甜虾 400g/盒 35-50只 腹籽 生鲜 海鲜水产", "37."],
    14: ["梅见青梅酒12度 梅酒 果酒330ml单瓶装", "38."],
    15: ["百草味 蜀香麻辣牛肉 手撕牛肉干肉类熟食小吃 麻辣牛肉100g/袋", "11."],
    16: ["奥智嘉 彩泥橡皮泥超轻粘土玩具DIY玩具 儿童玩具女孩男生玩具 面条机黏土雪糕机模具工具套装", "59."],
    17: ["修正手腕式家用血压测量仪 高精准电子血压仪器 USB充电款 全自动语音播老人血压器 BX318", "158."],
    18: ["华生（Wahson）暖手宝/取暖器/热水袋/暖水袋/暖宝宝/暖手袋/充电防爆 加绒保暖恒温WS-01（WZ0564）果绿", "46."],
    19: ["美的（Midea）T3-L326B 家用多功能电烤箱 35升 上下管独立控温 防爆照明灯易操作", "289."],
    20: ["和路雪 迷你可爱多甜筒 香草巧克力口味 冰淇淋家庭装 20g*10支 雪糕（新老包装 随机发货）", "17."],
  },
  "clothes": {
    1: ["【全新】卡帝乐鳄鱼CARTELO女士新款萌萌熊猫鞋做旧运动鞋 棕色(38/39码有货) 请联系客服备注尺码与颜色", "499."],
    2: ["【全新】卡帝乐鳄鱼CARTELO男士春秋潮流时尚休闲鞋 灰色(39到43码有货) 请联系客服备注尺码与颜色", "499."],
    3: ["全新BVLGARI宝格丽男女中性金色黑棕色框透明镜片光学镜框0BV1097 2022 56", "1731."],
    4: ["【全新】未拆封 新秀丽时尚便携旅行包经典时尚商务旅行包 简约便携袋多功能手提96Q*18015 灰色", "849."],
    5: ["Cantaloop凯特洛普 孕妇内衣胸罩怀孕期薄聚拢防下垂无钢圈背心式 孕期文胸（简约款） 白色 M", "65."],
    6: ["全新 纪梵希 中性款彩色狗头图案混纺围巾披肩 16S 9616 876 001", "1651."],
    7: ["【二手99新】精品足金硬金项坠 长方形民族风皮革绳黄金吊坠 净金重约2.22克", "1405."],
    8: ["95新 欧米茄 星座系列 111.25.23.60.55.003 石英 女表 间金镶钻", "18500."],
    9: ["【中原收藏】收淘老油橄榄核核雕原皮浮雕八仙(黄胖)(嘉臻)文玩手串【尺寸】1.7×2.6c", "268."],
    10: ["95新卡地亚蓝气球系列W69011Z4后镶钻正品腕表中性石英手表", "28200."],
    11: ["J Brand 设计师品牌/欧美潮牌女裤牛仔长裤 黑色 485V080 J3 26", "463."],
    12: ["幻想家进口材料防蓝光折叠手机电脑舒适360度旋转便携笔式超轻男女老花镜眼镜耐用专利保护镜片黑色 250度", "89."],
    13: ["【全新未使用】诺帝卡 NAUTICA 夏季轻便防滑耐磨休闲一字拖沙滩拖鞋男 黑蓝色 8#41", "118."],
    14: ["【全新库存】坚果（NOIX）NXD6004 旅行熊系列女包 女士包包单肩包手提包 米色3080957", "509."],
    15: ["为伴 指甲刀套装 指甲剪指甲钳修甲不锈钢甲沟炎修脚刀套装生日礼品-曜石黑9件套", "13."],
    16: ["【98新未使用】bally 巴利 女士钱包 6204978", "1250."],
    17: ["【全新未使用】Chain Kavin CK 时来运转皮带男百搭平滑扣镶钻头层牛皮鳄鱼纹礼盒装 金钢扣+黑鳄鱼纹带身 115cm", "158."],
    18: ["宝格丽（BVLGARI） 圣诞节礼物SAVE THE CHILDRENS慈善款系列男女同款银色戒指 AN855770 346097-52", "5199."],
    19: ["【全新】卡帝乐鳄鱼CARTELO男士时尚潮流高帮增高休闲鞋 红黄(40/41码有货) 请联系客服备注尺码与颜色", "499."],
    20: ["[99新]PaulFrank大嘴猴18K金Vegas—Club幸运草串珠N07198918", "879."],
  },
  "import": {
    1: ["智利进口车厘子 大樱桃精选大果 4JJJJ级 果径30-35mm 1000g 顺丰空运发货 2斤礼盒装", "239."],
    2: ["鲜惠源 泰国进口金枕头榴莲 巴掌榴莲 新鲜生鲜水果 坏果包赔新鲜 4-5斤（单个", "178."],
    3: ["夔源泰国进口红肉菠萝蜜京东生鲜木菠萝新鲜水果不是海南菠萝蜜假榴莲蜜 泰国红肉菠萝蜜7-11斤铂金果", "89."],
    4: ["韩国慕那美（monami）04008Z13 纤维笔水性笔彩色中性笔 12色套装", "18."],
    5: ["Labrada 高蛋白营养代餐液体即饮奶昔500ml 香草味 【美国原装进口】", "28."],
    6: ["美果汇 牛油果 鳄梨 新鲜水果 4枚装小果单果70-100g", "16."],
    7: ["现货 新鲜秘鲁进口蓝莓水果当季蓝莓鲜果蓝梅稀有时令蓝莓 蓝莓 2盒", "28."],
    8: ["Haubi's好必食黄油扭结棍(3个装)黄油注芯普雷结德国碱水面包营养早餐全熟速冻锁鲜 解冻即食速 烤烘焙", "49."],
    9: ["雅诗兰黛DW粉底液持久控油不脱妆 62#-2C0自然偏白", "238."],
    10: ["英国进口this works deep sleep深度睡眠助眠枕头喷雾精油香薰普通版75ml", "179."],
    11: ["日本国誉(KOKUYO)日本进口个性办公商务文具ID证件胸卡易拉扣伸缩扣防翻转伸缩长度60cm圆型1根装NAFU-R1N", "18."],
    12: ["泰国椰青椰子9个原箱 单果约750-1000g 香椰新鲜水果京东生鲜", "70."],
    13: ["哈根达斯 草莓口味 脆皮冰淇淋 69g", "38."],
    14: ["猫山王榴莲肉马来西亚进口果肉 D197水果液氮冷冻水果（400g/盒）猫山王榴莲 （猫山王榴莲 400g*1盒）", "168."],
    15: ["已通过核酸检测 大口鲜 智利熟冻帝王蟹（整只）1200-1400g 海鲜水产 礼品礼盒装礼包", "459."],
    16: ["天美时TIMEX男表T2N721多功能户外运动潮汐手表温度计指南针100米防水夜光石英表", "1299."],
    17: ["AEG欧洲原装进口15套独立式家用大容量洗碗机 卫星喷淋 双重烘干 玻璃呵护 进度投影 FFB83710PB", "9990."],
    18: ["日本国誉（KOKUYO）日本进口文具手工制活页夹可装订厚度（18mm）黑312*273*40mm TFB3040-BK 1个装", "207."],
    19: ["中国台湾进口零食 77牌松塔千层酥曲奇威化饼干12粒（新老规格随机发货）", "19."],
    20: ["麴醇堂（KOOKSOONDANG）米酒 韩国进口玛克丽米酒（原味）750ml*2瓶", "40."],
  },
}

const selectSecondKillLeftTextTime = document.querySelector(".secondKill_left_text_time");
const selectSecondKillLeftTimeHour = document.querySelector(".secondKill_left_time_hour");
const selectSecondKillLeftTimeMinute = document.querySelector(".secondKill_left_time_minute");
const selectSecondKillLeftTimeSecond = document.querySelector(".secondKill_left_time_second");
const secondKillChileItem = '<li class="secondKill_mid_slider_item"><img class="secondKill_mid_slider_item_img" src="" alt=""><div class="secondKill_mid_slider_item_information"><div class="secondKill_mid_slider_item_information_text"></div><div class="secondKill_mid_slider_item_information_price"><div class="secondKill_mid_slider_item_information_priceKill"></div><div class="secondKill_mid_slider_item_information_priceOrigin"></div></div></div></li>';
let secondKillContainer = {
  1: ["夏新（AMOI）F9无线5.0双耳超小迷你隐形TWS触控蓝牙耳机耳塞式入耳式运动跑步 小米苹果安卓手机通用 黑色", "39.00", "¥59.00"],
  2: ["机械师（MACHENIKE）27英寸 2K高清 IPS技术 HDR 电竞屏游戏显示器 165Hz 1ms响应 10.7亿色 升降旋转", "1799.00", "¥2399.00"],
  3: ["镭威视高清监控摄像头4g监控器家用套装网络商用无线wifi手机远程户外防水360度全景旋转球机室外 【WiFi-300万】全彩夜视+语音对讲+云台旋转", "168.00", "¥299.00"],
  4: ["七度空间卫生巾日夜用组合套装超薄优雅少女护垫混合装整箱姨妈巾 优雅少女17包98片（含护垫20片） 品质保证", "57.90", "¥150.00"],
  5: ["TCL-C65强光手电筒超亮远射三代P70USB充电式户外小型家用应急防身骑行灯 【TCL 品牌】C65 P50灯珠续航3~4小时", "39.00", "¥120.00"],
  6: ["晾霸 LB01智能晾衣机 阳台晒衣架自动升降四杆伸缩无线遥控LED照明电动晾衣架 格调灰 LED大灯+上门安装", "1539.00", "¥1799.00"],
  7: ["嘉年华(Carnival)手表女士超薄时尚百搭日历夜光防水镶钻石英女表学生手表 玫白钻点钢带 8685", "398.00", "¥488.00"],
  8: ["【二手95新】Apple MacBook Air 二手苹果笔记本电脑超轻薄便携商务本13.3英寸 i5-8G/128G-13寸-GF2【2016】", "2999.00", "¥3688.00"],
  9: ["达尔优EK812 104键混光静音机械键盘 游戏电竞 键盘机械师（全键无冲 CF吃鸡LOL 全尺寸） EK812升级版【青轴】【有手托/有多媒体键】", "198.00", "¥229.00"],
  10: ["麦壳 汽车用品车内饰品装饰配件洗车毛巾擦车巾车载汽车用品大全黑科技凯迪拉克汉兰达冠道途昂探岳宝马5系 双面加厚擦车巾30*60cm 【1条装】", "9.9", "¥29.00"],
  11: ["【百亿补贴】顺丰速运 江西赣南脐橙 新鲜橙子 国产水果 赣南脐橙4.5-5斤【单果200-300g】", "19.8", "¥50.00"],
  12: ["科爱元素 膝盖理疗仪老年人护膝保暖风湿关节炎膝关节震动按摩理疗仪积液热敷骨质积水增生腿部按摩器 震动升级版", "687.00", "¥1599.00"],
  13: ["九阳（Joyoung）炒锅不粘锅30cm炒菜锅304不锈钢电磁炉煤气灶通用平底锅锅具锅盖可立CJ538", "99.00", "¥169.00"],
  14: ["冇心暖手宝充电宝10000毫安数显移动电源暖手神器二合一迷你便携式无水防爆安全学生冬季宿舍取暖 星辰【配充电线+绒布收纳袋】", "118.00", "¥138.00"],
  15: ["适配欧乐B/OralB牙刷头成人EB50-3 多角度清洁配件替换头四支装 SB20A", "86.00", "¥99.00"],
  16: ["Vistline 棉鞋女2020冬季加绒保暖雪地靴女潮流百搭舒适女鞋显瘦增高休闲鞋女 G88-1-卡其色 35", "155.80", "¥518.00"],
  17: ["Goldlion/金利来男鞋秋冬鸵鸟纹时尚简约正装鞋 商务舒适婚鞋男鞋 黑色（偏大一码） 42", "379.00", "¥1169.00"],
  18: ["GILLE T26电动车头盔 男女夏天电瓶安全帽单镜片四季半盔 夏季轻便防晒头盔 均码 粉色 配蓝色海洋镜片", "35.00", "¥68.00"],
  19: ["初心胡桃木首饰盒简约饰品盒结婚礼物生日送礼实木多层大容量圣诞节送女友礼物 胡桃木首饰盒(带抽屉款)", "399.00", "¥539.00"],
  20: ["拓洁 空气触媒甲醛清除剂家用新房装修去除甲醛喷雾剂室内家具汽车除味喷剂（薄荷空间）280ml", "79.90", "¥179.00"],
  21: ["夏新（AMOI）F9无线5.0双耳超小迷你隐形TWS触控蓝牙耳机耳塞式入耳式运动跑步 小米苹果安卓手机通用 黑色", "39.00", "¥59.00"],
  22: ["机械师（MACHENIKE）27英寸 2K高清 IPS技术 HDR 电竞屏游戏显示器 165Hz 1ms响应 10.7亿色 升降旋转", "1799.00", "¥2399.00"],
  23: ["镭威视高清监控摄像头4g监控器家用套装网络商用无线wifi手机远程户外防水360度全景旋转球机室外 【WiFi-300万】全彩夜视+语音对讲+云台旋转", "168.00", "¥299.00"],
  24: ["七度空间卫生巾日夜用组合套装超薄优雅少女护垫混合装整箱姨妈巾 优雅少女17包98片（含护垫20片） 品质保证", "57.90", "¥150.00"],
}

const selectFindGoodList = $(".findGood_right_container_list");
let findGoodItemTextContainer = {
  1: ["华为 Mate40 Pro 5G手机"],
  2: ["DAHON 折叠 自行车"],
  3: ["华硕 8G内存 吃鸡游戏显卡"],
  4: ["小牛 轻便 踏板车"],
  5: ["海澜之家 立领舒适 羽绒服"],
  6: ["施华洛世奇 镂空圆环 耳钉"],
  7: ["红袖 粉色狐狸毛 皮草"],
  8: ["安热沙 保护肌肤 防晒乳"],
  9: ["Beats urBeats3 入耳式耳机"],
  10: ["茅台 53度酱香型 白酒"],
  11: ["华为 Mate40 Pro 5G手机"],
  12: ["DAHON 折叠 自行车"],
  13: ["华硕 8G内存 吃鸡游戏显卡"],
  14: ["小牛 轻便 踏板车"],
  15: ["海澜之家 立领舒适 羽绒服"],
}

const topNavHoverLeftTitleItem = '<li class="topNavHover_inner_left_title_item"><a href="javascript:void(0)" class="topNavHover_inner_left_title_item_link"><div class="topNavHover_inner_left_title_item_text"></div><i class="fa fa-angle-right" aria-hidden="true"></i></a></li>';
const topNavHoverLeftContentList = '<dl class="topNavHover_inner_left_content_list"><dt class="topNavHover_inner_left_content_list_title"><div class="topNavHover_inner_left_content_list_title_text"></div><i class="fa fa-angle-right" aria-hidden="true"></i></dt><dd class="topNavHover_inner_left_content_items"></dd></dl>';
const topNavHoverLeftContentItem = '<div class="topNavHover_inner_left_content_item"><a class="topNavHover_inner_left_content_link"></a></div>';
let topNavHoverContainer = [
  // 0
  {
    "title": ["家电馆", "家电专卖店", "家电服务", "企业采购", "商用电器", "高价回收"],
    "subTitle": [{
      "subSubtitle": "电视",
      "items": ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
    }, {
      "subSubtitle": "空调",
      "items": ["空调挂机", "空调柜机", "中央空调", "变频空调", "一级能效", "移动空调", "以旧换新"]
    }, {
      "subSubtitle": "洗衣机",
      "items": ["滚筒洗衣机", "洗烘一体机", "波轮洗衣机", "迷你洗衣机", "烘干机", "洗衣机配件"]
    }, {
      "subSubtitle": "冰箱",
      "items": ["多门", "对开门", "三门", "双门", "冷柜/冰吧", "酒柜", "冰箱配件"]
    }, {
      "subSubtitle": "厨卫大电",
      "items": ["油烟机", "燃气灶", "烟灶套装", "集成灶", "消毒柜", "洗碗机", "电热水器", "燃气热水器", "空气能热水器", "太阳能热水器", "嵌入式厨电", "烟机灶具配件"]
    }, {
      "subSubtitle": "生活电器",
      "items": ["破壁机", "电烤箱", "电饭煲", "电压力锅", "电炖锅", "豆浆机", "料理机", "咖啡机", "电饼档", "榨汁机/原汁机", "电水壶/热水瓶", "微波炉", "电热饭盒", "电热火锅", "养生壶", "电磁炉", "面包机", "空气炸锅", "面条机", "电陶炉", "煮蛋器", "电烧烤炉"]
    }, {
      "subSubtitle": "个护健康",
      "items": ["剃须刀", "电动牙刷", "电吹风", "美容仪", "洁面仪", "按摩器", "健康秤", "卷/直发器", "剃/脱毛器", "理发刀", "足浴盆", "足疗机", "按摩椅"]
    }, {
      "subSubtitle": "视听影音",
      "items": ["家庭影院", "KTV音响", "迷你音响", "DVD", "功放", "回音壁", "麦克风"]
    }]
  },
  // 1
  {
    "title": ["玩3C", "手机频道", "网上营业厅", "配件频道", "智能数码", "影响Club"],
    "subTitle": [{
      "subSubtitle": "手机通讯",
      "items": ["手机", "游戏手机", "5G手机", "拍照手机", "全面屏手机", "老人机", "对讲机", "以旧换新", "手机维修"]
    }, {
      "subSubtitle": "运营商",
      "items": ["合约机", "手机卡", "宽带", "充话费/流量", "中国电信", "中国移动", "中国联通", "京东通信", "挑靓号"]
    }, {
      "subSubtitle": "手机配件",
      "items": ["手机壳", "贴膜", "手机存储卡", "数据线", "充电器", "手机耳机", "创意配件", "手机饰品", "手机电池", "苹果周边", "移动电源", "蓝牙耳机", "手机支架", "拍照配件"]
    }, {
      "subSubtitle": "摄影摄像",
      "items": ["数码相机", "微单相机", "单反相机", "拍立得", "运动相机", "摄像头", "镜头", "户外器材", "影棚器材", "冲印服务", "数码相框"]
    }, {
      "subSubtitle": "数码配件",
      "items": ["存储卡", "三脚架/云台", "相机包", "滤镜", "闪光灯/手柄", "相机清洁/贴膜", "机身附件", "镜头附件", "读卡器", "支架", "电池/充电器"]
    }, {
      "subSubtitle": "影音娱乐",
      "items": ["耳机/耳麦", "音箱/音响", "智能音箱", "收音机", "麦克风", "MP3/MP4", "专业音频", "音频线"]
    }, {
      "subSubtitle": "智能设备",
      "items": ["智能手环", "智能手表", "智能眼镜", "智能机器人", "运动跟踪器", "健康监测", "智能配饰", "智能家居", "体感车", "无人机", "监控摄像"]
    }, {
      "subSubtitle": "电子教育",
      "items": ["学生平板", "点读机/笔", "早教益智", "录音笔", "电纸书", "电子词典", "复读机", "翻译机"]
    }]
  },
  // 2
  {
    "title": ["玩3C", "电脑办公", "企业采购", "GAME+", "装机大师", "企业租赁"],
    "subTitle": [{
      "subSubtitle": "电脑整机",
      "items": ["笔记本", "游戏本", "平板电脑", "台式机", "一体机", "服务器/工作站"]
    }, {
      "subSubtitle": "电脑配件",
      "items": ["显示器", "CPU", "主板", "显卡", "硬盘", "内存", "机箱", "电源", "散热器", "显示器支架", "刻录机/光驱", "声卡/扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB分线器", "主板CPU套装"]
    }, {
      "subSubtitle": "外设产品",
      "items": ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源", "插座", "平板电脑配件", "笔记本配件"]
    }, {
      "subSubtitle": "游戏设备",
      "items": ["游戏机", "游戏耳机", "手柄/方向盘", "游戏软件", "游戏周边"]
    }, {
      "subSubtitle": "网络产品",
      "items": ["路由器", "网络机顶盒", "交换机", "网络存储", "网卡", "5G/4G上网", "网线", "网络配件"]
    }, {
      "subSubtitle": "办公设备",
      "items": ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机", "碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
    }, {
      "subSubtitle": "文具",
      "items": ["笔类", "本册/便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具画材", "财会用品", "文房四宝"]
    }, {
      "subSubtitle": "耗材",
      "items": ["硒鼓/墨粉", "墨盒", "色带", "纸类", "刻录光盘"]
    }, {
      "subSubtitle": "服务产品",
      "items": ["延保服务", "上门安装", "维修保养", "电脑软件"]
    }]
  },
  // 3
  {
    "title": ["家装城", "居家日用", "精品家具", "家装建材", "国际厨具", "装修服务"],
    "subTitle": [{
      "subSubtitle": "厨具",
      "items": ["水具酒具", "烹饪锅具", "炒锅", "碗碟套装", "厨房配件", "刀剪菜板", "锅具套装", "茶具", "咖啡具", "保温杯", "厨房置物架"]
    }, {
      "subSubtitle": "家纺",
      "items": ["四件套", "被子", "枕芯", "毛巾浴巾", "地毯地垫", "床垫/床褥", "毯子", "抱枕靠垫", "窗帘/窗纱", "床单/床笠", "被套", "枕巾枕套", "沙发垫套", "坐垫", "桌布/罩件", "蚕丝被", "乳胶枕", "电热毯", "羽绒被", "羊毛被"]
    }, {
      "subSubtitle": "生活日用",
      "items": ["收纳用品", "雨伞雨具", "净化除味", "浴室用品", "洗晒/熨烫", "缝纫/针织用品", "保暖防护", "清洁工具"]
    }, {
      "subSubtitle": "家装软饰",
      "items": ["装饰字画", "装饰摆件", "手工/十字绣", "相框/照片墙", "墙贴/装饰贴", "花瓶花艺", "香薰蜡烛", "节庆饰品", "钟饰", "帘艺隔断", "创意家居", "3D立体墙贴", "玻璃贴纸", "电视背景墙", "电表箱装饰画"]
    }, {
      "subSubtitle": "灯具",
      "items": ["吸顶灯", "吊灯", "台灯", "筒灯射灯", "庭院灯", "装饰灯", "LED灯", "氛围照明", "落地灯", "应急灯/手电", "节能灯"]
    }, {
      "subSubtitle": "家具",
      "items": ["客厅", "卧室", "餐厅", "书房", "儿童", "储物", "办公家具", "阳台户外", "电脑桌", "电视柜", "茶几", "办公柜", "进口/原创", "沙发", "床", "床垫", "餐桌", "衣柜", "书架", "鞋柜", "置物架", "电脑椅", "晾衣架", "儿童床", "儿童桌椅", "红木"]
    }, {
      "subSubtitle": "全屋定制",
      "items": ["定制衣柜", "榻榻米", "橱柜", "门", "室内门", "防盗门", "窗", "淋浴房", "壁挂炉", "散热器"]
    }, {
      "subSubtitle": "建筑材料",
      "items": ["油漆涂料", "涂刷辅料", "瓷砖", "地板", "壁纸", "强化地板", "美缝剂", "防水涂料", "管材管件", "木材/板材"]
    }, {
      "subSubtitle": "厨房卫浴",
      "items": ["水槽", "龙头", "淋浴花洒", "马桶", "智能马桶", "智能马桶盖", "厨卫挂件", "浴室柜", "浴霸", "集成吊顶", "垃圾处理器"]
    }, {
      "subSubtitle": "五金电工",
      "items": ["指纹锁", "电动工具", "手动工具", "测量工具", "工具箱", "劳防用品", "开关插座", "配电箱/断路器", "机械锁", "拉手"]
    }, {
      "subSubtitle": "装修设计",
      "items": ["全包装修", "半包装修", "家装设计", "高端设计", "局部装修", "安装服务", "装修公司", "旧房翻新"]
    }]
  },
  // 4
  {
    "title": ["男装", "女装", "内衣", "童装童鞋"],
    "subTitle": [{
      "subSubtitle": "女装",
      "items": ["当季热卖", "新品推荐", "商场同款", "时尚套装", "羽绒服", "毛呢大衣", "棉服", "针织衫", "羊绒衫", "连衣裙", "皮草", "卫衣", "短外套", "休闲裤", "牛仔裤", "T恤", "衬衫", "小西装", "风衣", "半身裙", "大码女装", "中老年女装", "打底裤", "加绒裤", "短裤", "正装裙", "毛衣", "打底衫", "马甲", "吊带/背心", "旗袍/汉服", "雪纺衫", "礼服", "婚纱", "仿皮皮衣", "真皮皮衣", "设计师/潮牌"]
    }, {
      "subSubtitle": "男装",
      "items": ["当季热卖", "新品推荐", "T恤", "牛仔裤", "休闲裤", "衬衫", "短裤", "POLO衫", "羽绒服", "棉衣", "真皮皮衣", "夹克", "卫衣", "毛呢大衣", "大码男装", "西服套装", "仿皮皮衣", "风衣", "针织衫", "马甲/背心", "羊毛衫", "羊绒衫", "西服", "西裤", "卫裤/运动裤", "工装", "设计师/潮牌", "唐装/中山装", "中老年男装", "加绒裤"]
    }, {
      "subSubtitle": "内衣",
      "items": ["文胸", "睡衣/家居服", "男士内裤", "女士内裤", "吊带/背心", "文胸套装", "情侣睡衣", "塑身美体", "少女文胸", "休闲棉袜", "商务男袜", "连裤袜/丝袜", "美腿袜", "打底裤袜", "抹胸", "内衣配件", "大码内衣", "打底衫", "泳衣", "秋衣秋裤", "保暖内衣"]
    }, {
      "subSubtitle": "配饰",
      "items": ["女士围巾/披肩", "光学镜架/镜片", "毛线帽", "真皮手套", "毛线手套", "男士丝巾/围巾", "棒球帽", "太阳镜", "防辐射眼镜", "老花镜", "贝雷帽", "礼帽", "围巾/手套/帽子套装", "领带/领结/领带夹", "鸭舌帽", "口罩", "耳罩/耳包", "毛线/布面料", "遮阳帽", "遮阳伞/雨伞", "袖口", "钥匙扣", "游泳镜", "男士腰带/礼盒", "女士腰带/礼盒"]
    }, {
      "subSubtitle": "童装",
      "items": ["套装", "卫衣", "裤子", "外套/大衣", "毛衣/针织衫", "衬衫", "户外/运动服", "T恤", "裙子", "亲子装", "礼服/演出服", "羽绒服", "棉服", "内衣裤", "配饰", "家居服", "马甲", "袜子", "民族服装", "婴儿礼盒", "连体衣/爬服"]
    }, {
      "subSubtitle": "童鞋",
      "items": ["运动鞋", "靴子", "帆布鞋", "皮鞋", "棉鞋", "凉鞋", "拖鞋"]
    }]
  },
  // 5
  {
    "title": ["清洁用品", "美妆馆", "个护馆", "妆比社", "京东国际美妆", "宠物馆"],
    "subTitle": [{
      "subSubtitle": "面部护肤",
      "items": ["礼盒", "美白", "防晒", "面膜", "洁面", "爽肤水", "精华", "眼霜", "乳液/面霜", "卸妆", "T区护理", "润唇膏"]
    }, {
      "subSubtitle": "香水彩妆",
      "items": ["隔离", "遮瑕", "气垫BB", "粉底", "腮红", "口红/唇膏", "唇釉/唇彩", "睫毛膏", "眼影", "眼线", "眉笔/眉粉", "散粉", "美甲", "女士香水", "男士香水", "彩妆工具", "男士彩妆", "彩妆套装"]
    }, {
      "subSubtitle": "男士护肤",
      "items": ["控油", "洁面", "乳液/面霜", "爽肤水", "剃须", "精华", "防晒", "套装/礼盒"]
    }, {
      "subSubtitle": "洗发护发",
      "items": ["洗发水", "护发素", "发膜/精油", "造型", "染发", "烫发", "假发", "美发工具", "洗护套装"]
    }, {
      "subSubtitle": "口腔护理",
      "items": ["牙膏", "牙粉", "牙贴", "牙刷", "牙线", "漱口水", "口喷", "假牙清洁", "套装"]
    }, {
      "subSubtitle": "身体护理",
      "items": ["花露水", "沐浴露", "香皂", "洗手液", "护手霜", "浴盐", "润肤", "精油", "美颈", "美胸", "纤体塑形", "手膜/足膜", "男士洗液", "走珠/止汗露", "脱毛刀/膏", "套装"]
    }, {
      "subSubtitle": "女性护理",
      "items": ["卫生巾", "卫生棉条", "卫生护垫", "私处护理"]
    }, {
      "subSubtitle": "纸品清洗",
      "items": ["抽纸", "卷纸", "湿巾", "厨房用纸", "湿厕纸", "洗衣凝珠", "洗衣液", "洗衣粉", "肥皂", "护理除菌"]
    }, {
      "subSubtitle": "家庭清洁",
      "items": ["洗洁精", "油污净", "洁厕灵", "消毒液", "地板清洁剂", "垃圾袋", "垃圾桶", "拖把/扫把", "驱蚊驱虫"]
    }, {
      "subSubtitle": "宠物生活",
      "items": ["狗粮", "狗罐头", "狗零食", "狗厕所", "尿垫", "猫粮", "猫罐头", "猫零食", "猫砂", "猫砂盆", "猫狗窝", "食具水具", "医疗保健", "宠物玩具", "宠物鞋服", "洗护美容", "宠物牵引", "小宠用品", "水族世界", "鱼缸/水族箱", "鱼粮/饲料", "水族活体"]
    }]
  },
  // 6
  {
    "title": ["自营鞋靴", "自营箱包", "时尚鞋包", "潮流珠宝", "奢侈品", "时尚K金"],
    "subTitle": [{
      "subSubtitle": "时尚女鞋",
      "items": ["新品推荐", "休闲鞋", "凉鞋", "单鞋", "拖鞋/人字拖", "高跟鞋", "妈妈鞋", "帆布鞋", "布鞋/绣花鞋", "内增高", "雨鞋/雨靴", "女靴", "雪地靴", "鱼嘴靴", "马丁靴", "裸靴", "松糕靴", "坡跟靴", "防水台", "鞋配件"]
    }, {
      "subSubtitle": "潮流女包",
      "items": ["真皮包", "单肩包", "手提包", "斜挎包", "双肩包", "钱包", "手拿包", "卡包/零钱包", "钥匙包"]
    }, {
      "subSubtitle": "精品男包",
      "items": ["男士钱包", "双肩包", "单肩/斜挎包", "商务公文包", "男士手包", "卡片名片夹", "钥匙包"]
    }, {
      "subSubtitle": "功能箱包",
      "items": ["拉杆箱", "拉杆包", "旅行包", "电脑包", "休闲运动包", "书包", "登山包", "腰包/胸包", "旅行配件"]
    }, {
      "subSubtitle": "奢侈品",
      "items": ["箱包", "钱包", "服饰", "腰带", "鞋靴", "太阳镜/眼镜框", "饰品/配件"]
    }, {
      "subSubtitle": "精选大牌",
      "items": ["GUCCI", "COACH", "雷朋", "施华洛世奇", "MK", "阿玛尼", "菲拉格慕", "VERSACE", "普拉达", "巴宝莉", "万宝龙"]
    }, {
      "subSubtitle": "钟表",
      "items": ["DW", "天梭", "浪琴", "欧米加", "萧邦", "阿玛尼", "卡西欧", "西铁城", "天王", "瑞表", "国表", "日韩表", "欧美表", "德表", "儿童手表", "智能手表", "闹钟", "挂钟", "座钟", "钟表配件", "钟表维修"]
    }, {
      "subSubtitle": "珠宝首饰",
      "items": ["黄金", "K金", "时尚饰品", "钻石", "翡翠", "和田玉", "银饰", "水晶玛瑙", "彩宝", "铂金", "木手串/把件", "珍珠", "发饰"]
    }, {
      "subSubtitle": "金银投资",
      "items": ["投资金", "投资银", "投资收藏"]
    }]
  },
  // 7
  {
    "title": ["体育服务", "运动城", "户外馆", "健身房", "骑行馆", "钟表城"],
    "subTitle": [{
      "subSubtitle": "流行男鞋",
      "items": ["新品推荐", "休闲鞋", "凉鞋", "商务休闲鞋", "正装鞋", "帆布鞋", "拖鞋", "功能鞋", "传统布鞋", "增高鞋", "男靴", "雨鞋", "工装鞋", "鞋配件"]
    }, {
      "subSubtitle": "运动鞋包",
      "items": ["跑步鞋", "休闲鞋", "篮球鞋", "帆布鞋", "板鞋", "拖鞋", "运动包", "足球鞋", "专项运动鞋", "训练鞋"]
    }, {
      "subSubtitle": "运动服饰",
      "items": ["羽绒服", "运动套装", "运动裤", "卫衣/套头衫", "棉服", "夹克/风衣", "T恤", "运动配饰", "健身服", "运动背心", "运动内衣"]
    }, {
      "subSubtitle": "健身训练",
      "items": ["跑步机", "动感单车", "健身车", "椭圆机", "综合训练器", "划船机", "甩脂机", "倒立机", "踏步机", "哑铃", "仰卧板/收腹机", "瑜伽用品", "舞蹈用品", "运动护具", "健腹轮", "拉力器/臂力器", "跳绳", "引体向上器"]
    }, {
      "subSubtitle": "骑车运动",
      "items": ["山地车", "公路车", "折叠车", "骑行服", "电动车", "电动滑板车", "城市自行车", "平衡车", "穿戴装备", "自行车配件"]
    }, {
      "subSubtitle": "体育用品",
      "items": ["乒乓球", "羽毛球", "篮球", "足球", "轮滑滑板", "网球", "高尔夫", "台球", "排球", "棋牌麻将", "民俗运动", "体育服务"]
    }, {
      "subSubtitle": "户外鞋服",
      "items": ["户外风衣", "徒步鞋", "T恤", "冲锋衣裤", "速干衣裤", "越野跑鞋", "滑雪服", "羽绒服/棉服", "休闲衣裤", "抓绒衣库", "溯溪鞋", "沙滩/凉拖", "休闲鞋", "软壳衣库", "功能内衣", "军迷服饰", "登山鞋", "工装鞋", "户外袜"]
    }, {
      "subSubtitle": "户外装备",
      "items": ["背包", "帐篷/垫子", "望远镜", "烧烤用具", "便携桌椅床", "户外配饰", "军迷用品", "野餐用品", "睡袋/吊床", "救援装备", "户外照明", "旅行装备", "户外工具", "户外仪表", "登山攀岩", "极限户外", "冲浪潜水", "滑雪装备"]
    }, {
      "subSubtitle": "垂钓用品",
      "items": ["钓竿", "鱼线", "浮漂", "鱼饵", "钓鱼配件", "渔具包", "钓箱钓椅", "鱼线轮", "钓鱼灯", "辅助装备"]
    }, {
      "subSubtitle": "游泳用品",
      "items": ["女士泳衣", "比基尼", "男士泳衣", "泳镜", "游泳圈", "游泳包防水包", "泳帽", "游泳配件"]
    }]
  },
  // 8
  {
    "title": ["全新汽车", "车管家", "旗舰店", "新车装备", "直营店", "油卡充值"],
    "subTitle": [{
      "subSubtitle": "房产",
      "items": ["最新开盘", "普通住宅", "别墅", "商业办公", "海外房产", "文旅地产", "长租公寓"]
    }, {
      "subSubtitle": "汽车车型",
      "items": ["微型车", "小型车", "紧凑型车", "中型车", "中大型车", "豪华车", "MPV", "SUV", "跑车"]
    }, {
      "subSubtitle": "汽车价格",
      "items": ["5-8万", "8-12万", "12-18万", "18-25万", "25-40万", "40万以上"]
    }, {
      "subSubtitle": "汽车品牌",
      "items": ["大众", "日产", "丰田", "别克", "宝骏", "本田"]
    }, {
      "subSubtitle": "维修保养",
      "items": ["京东保养", "汽机油", "轮胎", "添加剂", "防冻剂", "滤清器", "蓄电池", "变速箱油/滤", "雨刷", "刹车片/盘", "火花塞", "车灯", "轮毂", "维修配件", "汽车玻璃", "减震器", "正时皮带", "汽车喇叭", "汽修工具", "改装配件", "原厂件", "底盘装甲/护板"]
    }, {
      "subSubtitle": "汽车装饰",
      "items": ["座垫座套", "脚垫", "头枕腰靠", "方向盘套", "后备箱垫", "车载支架", "车钥匙扣", "香水", "碳包/净化剂", "扶手箱", "挂件摆件", "车用收纳袋/盒", "遮阳/雪挡", "车衣", "车贴", "踏板", "行李架/箱", "雨眉", "装饰条", "装饰灯", "功能小件", "车身装饰件"]
    }, {
      "subSubtitle": "车载电器",
      "items": ["行车记录仪", "车载充电器", "车机导航", "车载蓝牙", "智能驾驶", "对讲电台", "倒车雷达", "导航仪", "安全预警仪", "车载净化器", "车载吸尘器", "汽车音响", "车载冰箱", "应急电源", "逆变器", "车载影音", "车载生活电器", "车载电器配件"]
    }, {
      "subSubtitle": "美容清洗",
      "items": ["洗车机", "洗车水枪", "玻璃水", "清洁剂", "镀晶镀膜", "车蜡", "汽车贴膜", "补漆笔", "毛巾掸子", "洗车配件"]
    }, {
      "subSubtitle": "安全自驾",
      "items": ["胎压监测", "充气泵", "灭火器", "车载床", "应急救援", "防盗设备", "自驾野营", "摩托车", "摩托周边", "保温箱", "储物箱"]
    }, {
      "subSubtitle": "汽车服务",
      "items": ["保养维修", "洗车", "钣金喷漆", "清洗美容", "功能升级", "改装服务", "ETC", "驾驶培训", "油卡充值", "加油卡"]
    }]
  },
  // 9
  {
    "title": ["母婴", "玩具乐器", "奶粉馆", "尿裤馆", "京东国际母婴"],
    "subTitle": [{
      "subSubtitle": "奶粉",
      "items": ["1段", "2段", "3段", "4段", "孕妈奶粉", "特殊配方奶粉", "有机奶粉"]
    }, {
      "subSubtitle": "营养辅食",
      "items": ["米粉/菜粉", "面条/粥", "果泥/果汁", "益生菌/初乳", "DHA", "钙铁锌/维生素", "清火/开胃", "宝宝零食"]
    }, {
      "subSubtitle": "尿裤湿巾",
      "items": ["NB", "S", "M", "L", "XL", "XXL", "拉拉裤", "成人尿裤", "婴儿湿巾"]
    }, {
      "subSubtitle": "喂养用品",
      "items": ["奶瓶奶嘴", "吸奶器", "暖奶消毒", "辅食料理机", "牙胶安抚", "食物存储", "儿童餐具", "水壶/水杯", "围兜/防溅衣"]
    }, {
      "subSubtitle": "洗护用品",
      "items": ["宝宝护肤", "日常护理", "洗发沐浴", "洗澡用具", "洗衣液/皂", "理发器", "婴儿口腔清洁", "坐便器", "驱蚊防晒"]
    }, {
      "subSubtitle": "寝居服饰",
      "items": ["睡袋/抱被", "婴儿枕", "毛毯棉被", "婴童床品", "浴巾/浴衣", "毛巾/口水巾", "婴儿礼盒", "婴儿内衣", "婴儿外出服", "隔尿垫巾", "尿布", "安全防护", "爬行垫", "婴儿鞋帽袜"]
    }, {
      "subSubtitle": "妈妈专区",
      "items": ["防辐射服", "孕妈装", "孕妇护肤", "妈咪包/背婴带", "待产护理", "产后塑身", "文胸/内裤", "防溢乳垫", "孕期营养"]
    }, {
      "subSubtitle": "童车童床",
      "items": ["安全座椅", "婴儿推车", "婴儿床", "婴儿床垫", "餐椅", "摇椅", "学步车", "三轮车", "自行车", "扭扭车", "滑板车", "电动车"]
    }, {
      "subSubtitle": "玩具",
      "items": ["益智玩具", "健身/戏水", "橡皮泥", "绘画/DIY", "积木拼装", "遥控/电动", "毛绒玩具", "娃娃玩具", "动漫玩具", "模型玩具", "创意减压", "STEAM/科学实验玩具"]
    }, {
      "subSubtitle": "乐器",
      "items": ["钢琴", "电钢琴", "电子琴", "吉他", "尤克里里", "打击乐器", "西洋管弦", "民族乐器", "乐器配件"]
    }]
  },
  // 10
  {
    "title": ["生鲜", "食品饮料", "酒类", "地方特产", "京东国际美食"],
    "subTitle": [{
      "subSubtitle": "新鲜水果",
      "items": ["苹果", "橙子", "奇异果/猕猴桃", "火龙果", "榴莲", "芒果", "椰子", "车厘子", "百香果", "柚子", "国产水果", "进口水果"]
    }, {
      "subSubtitle": "蔬菜蛋品",
      "items": ["蛋品", "叶菜品", "根茎类", "葱姜蒜椒", "鲜菌菇", "茄果瓜类", "半加工蔬菜", "半加工豆制品", "玉米", "山药", "地瓜/红薯"]
    }, {
      "subSubtitle": "精选肉类",
      "items": ["猪肉", "牛肉", "羊肉", "鸡肉", "鸭肉", "冷鲜肉", "特色肉类", "内脏类", "冷藏熟食", "牛排", "牛腩", "鸡翅"]
    }, {
      "subSubtitle": "海鲜水产",
      "items": ["鱼类", "虾类", "蟹类", "贝类", "海参", "鱿鱼/章鱼", "活鲜", "三文鱼", "大闸蟹", "小龙虾", "海鲜加工品", "海产干货"]
    }, {
      "subSubtitle": "冷饮冻食",
      "items": ["水饺/馄炖", "汤圆/元宵", "面点", "烘培半成品", "奶酪/黄油", "方便速食", "火锅丸串", "冰淇淋", "冷藏饮料", "低温奶", "生日蛋糕"]
    }, {
      "subSubtitle": "中外名酒",
      "items": ["白酒", "葡萄酒", "洋酒", "啤酒", "黄酒/养生酒", "收藏酒/陈年老酒"]
    }, {
      "subSubtitle": "进口食品",
      "items": ["牛奶", "饼干蛋糕", "糖/巧克力", "零食", "水", "饮料", "咖啡粉", "冲调品", "油", "方便食品", "米面调味"]
    }, {
      "subSubtitle": "休闲食品",
      "items": ["中华老字号", "营养零食", "休闲零食", "膨化食品", "坚果炒货", "肉干/熟食", "蜜饯果干", "糖果/巧克力", "饼干蛋糕", "月饼"]
    }, {
      "subSubtitle": "地方特产",
      "items": ["北京", "新疆", "陕西", "云南", "山东", "广西"]
    }, {
      "subSubtitle": "茗茶",
      "items": ["铁观音", "普洱", "龙井", "绿茶", "红茶", "乌龙茶", "茉莉花茶", "花草茶", "花果茶", "黑茶", "白茶", "养生茶", "其他茶"]
    }, {
      "subSubtitle": "饮料冲调",
      "items": ["饮料", "牛奶酸奶", "饮用水", "咖啡/奶茶", "蜂蜜/蜂产品", "冲饮谷物", "成人奶茶"]
    }, {
      "subSubtitle": "粮油调味",
      "items": ["大米", "食用油", "面", "杂粮", "调味品", "南北干活", "方便食品", "烘培原料", "有机食品"]
    }]
  },
  // 11
  {
    "title": ["京东礼品", "火机烟具", "鲜花", "京东农服", "同城绿植", "园林园艺"],
    "subTitle": [{
      "subSubtitle": "艺术品",
      "items": ["油画", "版画", "水墨画", "书法", "雕塑", "艺术画册", "艺术衍生品"]
    }, {
      "subSubtitle": "火机烟具",
      "items": ["打火机", "一次性打火机", "烟嘴", "烟盒", "烟斗"]
    }, {
      "subSubtitle": "礼品",
      "items": ["创意礼品", "电子礼品", "工艺礼品", "美妆礼品", "婚礼节庆", "礼盒礼券", "礼品定制", "军刀军具", "古董文玩", "收藏品", "礼品文具", "熏香", "京东卡", "生日礼物"]
    }, {
      "subSubtitle": "鲜花速递",
      "items": ["鲜花", "每周一花", "永生花", "香皂花", "卡通花束", "干花"]
    }, {
      "subSubtitle": "绿植园艺",
      "items": ["桌面绿植", "苗木", "绿植盆栽", "多肉植物", "花卉", "种子种球", "花盆花器", "园艺土肥", "园艺工具", "园艺机械"]
    }, {
      "subSubtitle": "种子",
      "items": ["花草林木类", "蔬菜/菌类", "瓜果类", "大田作物类"]
    }, {
      "subSubtitle": "农药",
      "items": ["杀虫剂", "杀菌剂", "除草剂", "植物生长调节剂"]
    }, {
      "subSubtitle": "肥料",
      "items": ["氮/磷/钾肥", "复合肥", "生物菌肥", "水溶/叶面肥", "有机肥"]
    }, {
      "subSubtitle": "畜牧养殖",
      "items": ["中兽药", "西兽药", "兽医器具", "生产/运输器具", "预混料", "浓缩料", "饲料添加剂", "全价料", "赶猪器/注射器", "养殖厂专用"]
    }, {
      "subSubtitle": "农机农具",
      "items": ["微耕机", "喷雾器", "割草机", "农机整机", "农机配件", "小型农机具", "农膜", "农技服务"]
    }]
  },
  // 12
  {
    "title": ["专科用药", "滋补养生", "膳食补充", "健康监测", "两性情话", "亮眼视界"],
    "subTitle": [{
      "subSubtitle": "中西药品",
      "items": ["感冒咳嗽", "补肾壮阳", "补气养血", "止痛镇痛", "耳鼻喉用药", "眼科用药", "口腔用药", "皮肤用药", "肠胃消化", "风湿骨外伤", "维生素/钙", "男科/泌尿", "妇科用药", "儿科用药", "心脑血管", "避孕药", "肝胆用药"]
    }, {
      "subSubtitle": "营养健康",
      "items": ["增强免疫", "骨骼健康", "补肾强身", "肠胃养护", "调节三高", "缓解疲劳", "养肝护肝", "改善贫血", "清咽利喉", "美容养颜", "减肥塑身", "改善睡眠", "明目益智"]
    }, {
      "subSubtitle": "营养成分",
      "items": ["维生素/矿物质", "胶原蛋白", "益生菌", "蛋白粉", "玛咖", "酵素", "膳食纤维", "叶酸", "番茄红素", "左旋肉碱"]
    }, {
      "subSubtitle": "滋补养生",
      "items": ["阿胶", "蜂蜜/蜂产品", "枸杞", "燕窝", "冬虫夏草", "人参/西洋参", "三七", "鹿茸", "雪蛤", "青线柳", "石斛/枫斗", "灵芝/孢子粉", "当归", "养生茶饮", "药食同源"]
    }, {
      "subSubtitle": "计生情趣",
      "items": ["避孕套", "排卵验孕", "润滑液", "男用延时", "飞机杯", "倒模", "仿真娃娃", "震动棒", "跳单", "仿真阳具", "情趣内衣"]
    }, {
      "subSubtitle": "保健器械",
      "items": ["血压计", "血糖仪", "心电仪", "体温计", "胎心仪", "制氧机", "呼吸机", "雾化器", "助听器", "轮椅", "拐杖", "护理床", "中医保健", "养身器械", "理疗仪", "家庭护理", "智能健康", "出行常备"]
    }, {
      "subSubtitle": "护理护具",
      "items": ["口罩", "眼罩/耳塞", "医用防疫用品", "跌打损伤", "创可帖", "暖贴", "鼻喉护理", "眼部保健", "美体护理"]
    }, {
      "subSubtitle": "隐形眼镜",
      "items": ["彩色隐形", "日抛", "月抛", "半年抛", "护理液", "润眼液", "眼镜配件"]
    }, {
      "subSubtitle": "健康服务",
      "items": ["体检套餐", "口腔齿科", "基因检测", "孕产服务", "医疗美容"]
    }]
  },
  // 13
  {
    "title": ["图书", "文娱", "教育培训", "电子书", "文娱寄卖商城"],
    "subTitle": [{
      "subSubtitle": "文学",
      "items": ["小说", "散文随笔", "青春文学", "传记", "动漫", "悬疑推理", "科幻", "武侠", "世界名著"]
    }, {
      "subSubtitle": "童书",
      "items": ["0-2 岁", "3-6 岁", "7-10 岁", "11-14 岁", "儿童文学", "绘本", "科普百科", "幼儿启蒙", "智力开发", "少儿英语", "玩具书"]
    }, {
      "subSubtitle": "教材教辅",
      "items": ["教材", "中小学教辅", "考试", "外语学习", "字典词典", "课外读物", "英语四六级", "会计类考试", "国家公务员"]
    }, {
      "subSubtitle": "人文社科",
      "items": ["历史", "心理学", "政治军事", "传统文化", "哲学宗教", "社会科学", "法律", "文化", "党政专区"]
    }, {
      "subSubtitle": "经管励志",
      "items": ["管理", "金融", "经济", "市场营销", "领导力", "股票", "投资", "励志与成功", "自我完善"]
    }, {
      "subSubtitle": "艺术",
      "items": ["绘画", "摄影", "音乐", "书法", "连环画", "设计", "建筑艺术", "艺术史", "影视"]
    }, {
      "subSubtitle": "科学技术",
      "items": ["计算机与互联网", "科普", "建筑", "工业技术", "电子通信", "医学", "科学与自然", "农林"]
    }, {
      "subSubtitle": "生活",
      "items": ["育儿家教", "孕产胎教", "健身保健", "旅游地图", "手工DIY", "烹饪美食"]
    }, {
      "subSubtitle": "刊/原版",
      "items": ["杂志/期刊", "英文原版书", "港台图书"]
    }, {
      "subSubtitle": "文娱音像",
      "items": ["音乐", "影视", "教育音像", "游戏", "影视/动漫周边"]
    }, {
      "subSubtitle": "教育培训",
      "items": ["青少年培训", "语言培训", "大学生培训", "考试考证培训", "职业技能培训"]
    }, {
      "subSubtitle": "电子书",
      "items": ["小说", "文学", "励志与成功", "经济管理", "传记", "社会科学", "计算基于互联网", "进口原版"]
    }, {
      "subSubtitle": "邮币",
      "items": ["邮票", "钱币", "邮资封片", "磁卡", "票证", "礼品册"]
    }]
  },
  // 14
  {
    "title": ["本周热推", "精选酒店", "特惠机票", "主题乐园", "电影票", "会议团建"],
    "subTitle": [{
      "subSubtitle": "交通出行",
      "items": ["国内机票", "国际机票", "火车票", "机场服务", "机票套餐"]
    }, {
      "subSubtitle": "酒店预订",
      "items": ["国内酒店", "国际酒店", "酒店套餐", "超值精选"]
    }, {
      "subSubtitle": "旅游度假",
      "items": ["国内旅游", "出境旅游", "全球签证", "景点门票", "邮轮", "旅行保险"]
    }, {
      "subSubtitle": "定制旅游",
      "items": ["团队建设", "奖励旅游", "会议周边", "会议展览"]
    }, {
      "subSubtitle": "演出票务",
      "items": ["电影选座", "演唱会", "音乐会", "话剧歌剧", "体育赛事", "舞蹈芭蕾", "戏曲综艺"]
    }, {
      "subSubtitle": "生活缴费",
      "items": ["水费", "电费", "煤气费", "城市通", "油卡充值", "加油卡"]
    }, {
      "subSubtitle": "生活服务",
      "items": ["家政保洁", "摄影写真", "丽人/养生", "代理代办"]
    }, {
      "subSubtitle": "彩票",
      "items": ["数据图表", "彩民服务"]
    }, {
      "subSubtitle": "游戏",
      "items": ["QQ 充值", "游戏卡点", "网页游戏", "游戏周边", "手机游戏", "单机游戏"]
    }, {
      "subSubtitle": "海外生活",
      "items": ["海外房产", "海外购物"]
    }]
  },
  // 15
  {
    "title": ["金融首页", "0 元评测"],
    "subTitle": [{
      "subSubtitle": "理财",
      "items": ["京东小金库", "基金理财", "定期理财"]
    }, {
      "subSubtitle": "众筹",
      "items": ["智能硬件", "流行文化", "生活美学", "公益", "其他权益众筹"]
    }, {
      "subSubtitle": "东家",
      "items": ["阳光私募"]
    }, {
      "subSubtitle": "白条",
      "items": ["京东白条", "白条联名卡", "京东钢镚", "安居白条"]
    }, {
      "subSubtitle": "支付",
      "items": ["京东支付"]
    }, {
      "subSubtitle": "保险",
      "items": ["健康险", "人寿险", "意外险", "旅行险", "财产险", "车险"]
    }, {
      "subSubtitle": "股票",
      "items": ["实时资讯", "市场行情", "投资达人"]
    }]
  },
  // 16
  {
    "title": ["京东服务+", "安装服务", "维修服务", "清洗保洁", "企悦服务", "特色服务"],
    "subTitle": [{
      "subSubtitle": "家电安装",
      "items": ["空调安装", "电视安装", "洗衣机安装", "热水器安装", "烟机/灶具安装", "净水器安装"]
    }, {
      "subSubtitle": "办公安装",
      "items": ["电脑安装", "办公设备安装"]
    }, {
      "subSubtitle": "家具安装",
      "items": ["家具安装", "灯具安装", "智能家居安装", "五金卫浴安装", "晾衣架安装"]
    }, {
      "subSubtitle": "家电维修",
      "items": ["空调维修", "电视维修", "洗衣机维修", "冰箱维修", "热水器维修", "油烟机维修", "燃气灶维修"]
    }, {
      "subSubtitle": "手机维修",
      "items": ["屏幕换新", "电池换新", "手机故障", "保障服务"]
    }, {
      "subSubtitle": "办公维修",
      "items": ["笔记本维修", "平板维修"]
    }, {
      "subSubtitle": "数码维修",
      "items": ["智能家居维修", "无人机维修", "智能设备维修"]
    }, {
      "subSubtitle": "清洁保养",
      "items": ["家电清洗", "家居家纺洗护", "服装洗护", "鞋靴箱包保养"]
    }, {
      "subSubtitle": "特色服务",
      "items": ["家庭优惠套装", "企悦服务", "体育服务", "骑行服务", "钟表维修/保养"]
    }, {
      "subSubtitle": "二手数码",
      "items": ["苹果手机", "安卓手机", "充电器", "手机壳", "耳机/耳麦", "单反相机", "微单相机", "镜头", "智能手表", "游戏机"]
    }, {
      "subSubtitle": "二手电脑",
      "items": ["笔记本", "官翻电脑", "平板电脑", "台式机", "一体机", "显示器", "显卡", "CPU", "主板", "机箱", "组装电脑"]
    }, {
      "subSubtitle": "二手奢品",
      "items": ["钟表", "箱包", "饰品", "配件", "腰带", "钱包", "服饰", "鞋靴"]
    }, {
      "subSubtitle": "二手书",
      "items": ["期刊杂志", "教材", "文化社科", "历史", "经管", "文学", "小说", "艺术", "生活", "童书"]
    }]
  },
  // 17
  {
    "title": ["企业购", "工业品", "京东商用", "礼品卡", "元器件"],
    "subTitle": [{
      "subSubtitle": "工具",
      "items": ["手动工具", "电动工具", "测量工具", "气动工具", "工具套装", "工具配件"]
    }, {
      "subSubtitle": "劳动防护",
      "items": ["手部防护", "足部防护", "身体防护", "头部防护", "眼脸部防护", "呼吸防护", "坠落防护", "静电无尘"]
    }, {
      "subSubtitle": "工控配电",
      "items": ["电线电缆", "开关插座", "低压配电", "控制保护", "电力检测", "工业控制", "自动化", "电料辅件"]
    }, {
      "subSubtitle": "仪器仪表",
      "items": ["温度仪表", "电工仪表", "气体检测", "分析检测", "压力仪表", "流量仪表", "物位仪表", "阻容感及晶振", "半导体", "模块及开发板"]
    }, {
      "subSubtitle": "清洁用品",
      "items": ["清洁工具", "清洁设备", "清洗保养品", "工业擦拭", "底垫", "垃圾处理"]
    }, {
      "subSubtitle": "化学品",
      "items": ["润滑剂", "胶粘剂", "化学试剂", "工业涂层", "清洗剂", "防锈剂", "脱模剂"]
    }, {
      "subSubtitle": "安全消防",
      "items": ["警示标识", "应急处理", "监控设备", "安全锁具", "化学品存储", "消防器材", "消防服装"]
    }, {
      "subSubtitle": "仓储包装",
      "items": ["包装工具", "包装耗材", "标签耗材", "搬运设备", "存储设备"]
    }, {
      "subSubtitle": "焊接紧固",
      "items": ["五金紧固件", "密封件", "焊接设备", "焊接耗材"]
    }, {
      "subSubtitle": "机械配件",
      "items": ["轴承", "皮带链条", "机械零配件", "机床及附件", "刀具", "气动元件", "泵阀类"]
    }, {
      "subSubtitle": "暖通照明",
      "items": ["暖通", "工业照明", "管材管件"]
    }, {
      "subSubtitle": "实验用品",
      "items": ["实验室试剂", "实验室耗材", "实验室设备"]
    }]
  }
];
let hoveredItem;

/******* 方法定义 *******/
// 顶部右侧底部12格栏触碰更改显示图案
let setTopNavRightItemImg = function() {
  for (let i = 0; i < countTopNavRightBottomItemImg; i++) {
    selectTopNavRightBottomContainerItemImg[i].setAttribute("src", `./img/topNavRightItemImg${i + 1}.png`)
  }
}
// 京东秒杀栏创建子元素，显示列表
let createSecondKillChildren = function() {
  for (let i = 0; i < Object.keys(secondKillContainer).length; i++) {
    $(".secondKill_mid_slider_list").append(secondKillChileItem);
  }
  for (const key in secondKillContainer) {
    if (Object.hasOwnProperty.call(secondKillContainer, key)) {
      const element = secondKillContainer[key];
      $(`.secondKill_mid_slider_item_img`)[key - 1].setAttribute("src", `../img/secondKillMid${key}.jpg`)
      $(`.secondKill_mid_slider_item_information_text`)[key - 1].innerHTML = element[0];
      $(`.secondKill_mid_slider_item_information_priceKill`)[key - 1].innerHTML = element[1];
      $(`.secondKill_mid_slider_item_information_priceOrigin`)[key - 1].innerHTML = element[2];
    }
  }
};
// 京东秒杀左侧倒计时时间设置
function PrefixInteger(num, length = 2) {
  return (Array(length).join('0') + num).slice(-length);
}
let changeHour = function(endTime) {
  let hour = new Date().getHours();
  if (hour === endTime) {
    return 1;
  }
}
let changeMinuteSecond = function(startTime, endTime) {
  let hour = new Date().getHours();
  let minute = new Date().getMinutes();
  let second = new Date().getSeconds();
  let leftHour = PrefixInteger((endTime - hour - 1) % 2);
  let leftMinute = PrefixInteger((60 - minute - 1) % 60);
  let leftSecond = PrefixInteger((60 - second) % 60);
  selectSecondKillLeftTextTime.innerHTML = startTime;
  selectSecondKillLeftTimeHour.innerHTML = leftHour;
  selectSecondKillLeftTimeMinute.innerHTML = leftMinute;
  selectSecondKillLeftTimeSecond.innerHTML = leftSecond;
}
let setSecondKillTime = function() {
  let endTime = (new Date().getHours() + 2) % 24;
  if (endTime % 2) {
    endTime--;
  }
  setInterval(() => {
    if (changeHour(endTime)) {
      endTime += 2;
    }
    changeMinuteSecond(endTime - 2, endTime);
  }, 10);
}
// 每日特价创建子元素
let createEverydayDiscountChildren = function() {
  for (let i = 0; i < Object.keys(everydayDiscountContainer.choice).length; i++) {
    selectEverydayDiscountList.append(everydayDiscountChildItem);
  }
  let element = everydayDiscountContainer.choice;
  for (let i = 1; i <= Object.keys(everydayDiscountContainer.choice).length; i++) {
    $(".everydayDiscount_item_days")[i - 1].innerHTML = element[i][0] + "天最低价";
    $(".everydayDiscount_item_img")[i - 1].setAttribute("src", `../img/choice${i}.jpg`)
    $(".everydayDiscount_item_information_title")[i - 1].innerHTML = element[i][1];
    $(".everydayDiscount_item_information_priceKill")[i - 1].innerHTML = element[i][2];
    $(".everydayDiscount_item_information_priceOrigin")[i - 1].innerHTML = element[i][3];
  }
};
// 频道广场图片显示
let setImg = function() {
  for (let i = 0, flag = 0; flag < selectChannelSquareInnerItemBottomImg.length; flag++) {
    selectChannelSquareInnerItemBottomImg[flag].childNodes[1].setAttribute('src', `../img/channel${i + 3}_${flag% 2 + 1}.jpg`)
    if (flag % 2) {
      i++;
    }
  }
}
// 发现好物创建子元素
let createFindGoodChildren = function() {
  for (let i = 0; i < Object.keys(findGoodItemTextContainer).length; i++) {
    if (!(i % 2)) {
      selectFindGoodList.append('<div class="findGood_right_container_item"><div class="findGood_right_container_item_text"></div><img class="findGood_right_container_item_img" src="" alt=""></div>');
    } else {
      selectFindGoodList.append('<div class="findGood_right_container_item"><img class="findGood_right_container_item_img" src="" alt=""><div class="findGood_right_container_item_text"></div></div>');
    }
  }
  for (let i = 0; i < Object.keys(findGoodItemTextContainer).length; i++) {
    $(".findGood_right_container_item_img").eq(i).attr("src", `./img/findGoodSlider${i + 1}.jpg`);
    document.getElementsByClassName("findGood_right_container_item_text")[i].innerHTML = findGoodItemTextContainer[i + 1];
  }
  let a = 1;
  let findGoodSlider = function() {
    $(".findGood_right_container_list").css("left", `${(parseInt($(".findGood_right_container_list").css("left")) - a) % 2000}px`)
  }
  let findGoodSliderFlag = setInterval(findGoodSlider, 10);
  $(".findGood_right_container_item").hover(function() {
    clearInterval(findGoodSliderFlag);
  }, function() {
    findGoodSliderFlag = setInterval(findGoodSlider, 10);
  })
}
// 顶部下滑栏显示，并且在滑动到京东秒杀后，加载出为你推荐第一版（猜你喜欢）的数据
// 当顶部下滑栏显示时，也要改变右侧导航栏的高度
document.addEventListener("scroll", event => {
  let scrolled = html.scrollTop / (html.scrollHeight - html.clientHeight);
  beforeScroll = scrolled - beforeScroll;
  // 当滚动位置大于京东秒杀距离顶部的高度时，下滑导航栏
  if (scrolled >= secondKill.offsetTop / (html.scrollHeight - html.clientHeight)) {
    $(".headerDown").slideDown();
    $(".rightNav").css({
      "top": "70px",
      "position": "fixed",
    });
    $(".rightNav_item:last-child").css({
      "display": "flex",
      "position": "relative",
      "bottom": "0",
      "opacity": "1",
      "background-color": "#fff",
    })
    if (scrolled >= brand.offsetTop / (html.scrollHeight - html.clientHeight)) {
      $(".rightNavSecondKill").removeClass("rightNavActive");
      $(".rightNavBrand").addClass("rightNavActive");
      if (scrolled >= channelSquare.offsetTop / (html.scrollHeight - html.clientHeight)) {
        $(".rightNavBrand").removeClass("rightNavActive");
        $(".rightNavChannelSquare").addClass("rightNavActive");
        if (scrolled >= selectRecommendForYouList.offsetTop / (html.scrollHeight - html.clientHeight)) {
          $(".rightNavChannelSquare").removeClass("rightNavActive");
          $(".rightNavRecommendForYou").addClass("rightNavActive");
          $(".recommendForYouDown").slideDown();
          $(".rightNav").css({
            "top": "125px",
            "position": "fixed",
          });
        } else {
          $(".rightNavRecommendForYou").removeClass("rightNavActive");
          $(".rightNavChannelSquare").addClass("rightNavActive");
          $(".recommendForYouDown").slideUp();
          $(".rightNav").css({
            "top": "70px",
            "position": "fixed",
          });
        }
      } else {
        $(".rightNavChannelSquare").removeClass("rightNavActive");
        $(".rightNavBrand").addClass("rightNavActive");
      }
    } else {
      $(".rightNavBrand").removeClass("rightNavActive");
      $(".rightNavSecondKill").addClass("rightNavActive");
    }
    // 判定为你推荐部分是否创建子结点并显示文字以及图片
    if (!recommendAlreadyShow) {
      $(".recommendForYou_container_like_list").show();
      if (!$(".recommendForYou_container_like_list").hasClass("hasChildren")) {
        for (let i = 0; i < Object.keys(recommendContainer.like).length; i++) {
          $(`.recommendForYou_container_like_list`).append(recommendForYouChildItem);
        }
        $(".recommendForYou_container_like_list").addClass("hasChildren");
      }
      for (const key in recommendContainer.like) {
        if (Object.hasOwnProperty.call(recommendContainer.like, key)) {
          const element = recommendContainer.like[key];
          $(`.recommendForYou_container_like_list .recommendForYou_container_item_img`)[key - 1].setAttribute("src", `../img/like${key}.jpg`)
          $(`.recommendForYou_container_like_list .recommendForYou_container_item_information_text`)[key - 1].innerHTML = element[0];
          $(`.recommendForYou_container_like_list .recommendForYou_container_item_information_price`)[key - 1].innerHTML = element[1];
        }
      }
      recommendAlreadyShow = 1;
    }

  } else {
    $(".headerDown").slideUp();
    $(".rightNav").css({
      "top": "0",
      "position": "absolute",
    });
    $(".rightNav_item:last-child").css({
      "bottom": "60px",
      "opacity": "0",
      "background-color": "transparent"
    })
  }
})

createEverydayDiscountChildren();
createSecondKillChildren();
createFindGoodChildren();
setTopNavRightItemImg();
setSecondKillTime();
setImg();

$(document).ready(
  // 顶部广告的关闭
  $("#topAd_advertisement_close").click(e => {
    e.preventDefault();
    $(".topAd").fadeOut("slow");
  }),
  // 城市栏显示
  $(".topShortcut_location_link, .topShortcut_location_dropdown").mouseover(e => {
    e.preventDefault();
    $(".topShortcut_location_link").css({
      "position": "relative",
      "z-index": "99",
      "background-color": "#fff",
      "border-bottom": "none",
      "padding-left": "6px",
      "border-left": "1px solid #ccc",
      "border-right": "1px solid #ccc",
    });
    $(".topShortcut_location_dropdown").show()
  }),
  $(".topShortcut_location_link, .topShortcut_location_dropdown").mouseleave(function() {
    $(".topShortcut_location_link").css({
        "background-color": "",
        "padding-left": "7px",
        "border": "none",
      }),
      $(".topShortcut_location_dropdown").hide()
  }),
  //城市栏地址变化
  $(".topShortcut_location_cities_item").click(function(e) {
    e.preventDefault();
    document.querySelector(".topShortcut_location_link_text").innerHTML = this.innerHTML;
  }),
  // 我的京东、企业采购、客户服务、网站导航
  $(".myJD, .firmPurchase, .clientServe, .websiteNav").hover(function() {
    // over
    var classIDName = this.className.split(" ")[2];
    $(`#${classIDName}`).show();
    (classIDName === "myJD" || classIDName === "firmPurchase") ? $(`#${classIDName}`).css("left", `${this.offsetLeft}px`): (classIDName === "websiteNav" ? $(`#${classIDName}`).css("right", "0") : $(`#${classIDName}`).css("right", `${this.parentNode.offsetWidth - this.offsetWidth - this.offsetLeft + 1}px`))
    $(`.${classIDName}`).css({
      "position": "relative",
      "z-index": "99",
      "background-color": "#fff",
      "border-bottom": "none",
      "padding": "0 4px",
      "border-left": "1px solid #ccc",
      "border-right": "1px solid #ccc",
    });
  }, function() {
    var classIDName = this.className.split(" ")[2];
    // out
    $(`#${classIDName}`).hover(function() {
      $(`#${classIDName}`).show();
      $(`.${classIDName}`).css({
        "position": "relative",
        "z-index": "99",
        "background-color": "#fff",
        "border-bottom": "none",
        "padding": "0 4px",
        "border-left": "1px solid #ccc",
        "border-right": "1px solid #ccc",
      });
    }, function() {
      $(`#${classIDName}`).hide();
      $(`.${classIDName}`).css({
        "position": "relative",
        "z-index": "99",
        "background-color": "",
        "padding": "0 5px",
        "border": "none",
      });
    });
    $(`#${classIDName}`).hide();
    $(`.${classIDName}`).css({
      "position": "relative",
      "z-index": "99",
      "background-color": "",
      "padding": "0 5px",
      "border": "none",
    });
  }),
  // 触摸logo变化gif图
  $(".header_left").mouseenter(function() {
    // over
    $("#logoImg").attr("src", `./img/logoGif${parseInt(4 * Math.random()) + 1}.gif`)
    $("#logoImg").css({
      "width": "120px",
      "height": "120px",
      "position": "relative",
      "left": "50px",
    })
    setTimeout(() => {
      $("#logoImg").attr("src", "./img/topLogo.png")
      $("#logoImg").css({
        "width": "auto",
        "height": "auto",
        "position": "relative",
        "left": "0",
      })
    }, 5000);
  }),
  // 顶部特殊热搜词汇改变
  $("#header_midTop_bottom_special_hotWords").html(`${header_midTop_bottom_special_hotWords[0]}`),
  setInterval(() => {
    $("#header_midTop_bottom_special_hotWords").html(`${header_midTop_bottom_special_hotWords[(++countHotWords) % header_midTop_bottom_special_hotWords.length]}`);
  }, changeDuration * 2),
  // 顶部placeholder改变
  $(".inputKey").attr("placeholder", `${header_midTop_bottom_placeholder[0]}`),
  setInterval(() => {
    $(".inputKey").attr("placeholder", `${header_midTop_bottom_placeholder[(++countPlaceWords) % header_midTop_bottom_placeholder.length]}`);
  }, changeDuration),
  // 顶部左侧大菜单位置定位
  $(".topNavHover").css("left", `${parseInt($(".topNav_left").css("width")) + document.querySelector(".topNav_left").offsetLeft}px`),
  // 顶部左侧大菜单触摸显示
  $(".topNav_left_item").hover(function() {
    // 改变背景颜色
    $(this).css("background-color", "#ddd");
    // 获取当前触摸的所在的结点列表的下标，并以此获取对象中相应key的内容并渲染
    // 创建每个块顶部的黑色导航栏
    if ($(".topNavHover_inner_left_title_list").children().length !== 0) {
      $(".topNavHover_inner_left_title_list").empty();
    }
    for (let i = 0; i < topNavHoverContainer[$(this).index()].title.length; i++) {
      $(".topNavHover_inner_left_title_list").append(topNavHoverLeftTitleItem);
      $(".topNavHover_inner_left_title_item_text")[i].innerHTML = topNavHoverContainer[$(this).index()].title[i];
    }
    // 创建每个块的主要内容
    if ($(".topNavHover_inner_left_content_lists").children().length !== 0) {
      $(".topNavHover_inner_left_content_lists").empty();
    }
    for (let i = 0; i < topNavHoverContainer[$(this).index()].subTitle.length; i++) {
      $(".topNavHover_inner_left_content_lists").append(topNavHoverLeftContentList);
      $(".topNavHover_inner_left_content_list_title_text")[i].innerHTML = topNavHoverContainer[$(this).index()].subTitle[i].subSubtitle;
    }
    for (let i = 0; i < $(".topNavHover_inner_left_content_list").length; i++) {
      for (let j = 0; j < topNavHoverContainer[$(this).index()].subTitle[i].items.length; j++) {
        // console.log($(".topNavHover_inner_left_content_list")[i]);
        // $(".topNavHover_inner_left_content_list")[i].append(topNavHoverLeftContentItem);
        $(topNavHoverLeftContentItem).appendTo($(".topNavHover_inner_left_content_items")[i]);
      }
      for (let j = 0; j < topNavHoverContainer[$(this).index()].subTitle[i].items.length; j++) {
        $(".topNavHover_inner_left_content_items")[i].childNodes[j].childNodes[0].innerHTML = topNavHoverContainer[$(this).index()].subTitle[i].items[j];
      }
    }
    // 创建完成后，显示当前块
    $(".topNavHover").show();
  }, function() {
    hoveredItem = $(this);
    $(".topNavHover").hover(function() {
        $(".topNavHover").show();
        hoveredItem.css("background-color", "#ddd");
      },
      function() {
        $(".topNavHover").hide();
        hoveredItem.css("background-color", "#fff");
      });
    $(".topNavHover").hide();
    $(this).css("background-color", "");
  }),
  // 顶部大轮播图渐变显隐效果 按钮以及自动播放，圆形按钮变化效果
  $(".topNav_mid_left_slider_prev").click(function() {
    selectTopNavLeftSliderItems.removeClass("topNavLeftSliderActive");
    $(".topNav_mid_left_slider_button").removeClass("topNavLeftSliderButtonActive");
    if (topNavLeftSliderItemPosition <= 0) topNavLeftSliderItemPosition += countTopNavLeftSliderItems;
    let newPosition = (--topNavLeftSliderItemPosition) % countTopNavLeftSliderItems;
    selectTopNavLeftSliderItems[newPosition].classList.add("topNavLeftSliderActive");
    $(".topNav_mid_left_slider_button")[newPosition].classList.add("topNavLeftSliderButtonActive");
  }),
  $(".topNav_mid_left_slider_next").click(function() {
    selectTopNavLeftSliderItems.removeClass("topNavLeftSliderActive");
    $(".topNav_mid_left_slider_button").removeClass("topNavLeftSliderButtonActive");
    let newPosition = (++topNavLeftSliderItemPosition) % countTopNavLeftSliderItems;
    selectTopNavLeftSliderItems[newPosition].classList.add("topNavLeftSliderActive");
    $(".topNav_mid_left_slider_button")[newPosition].classList.add("topNavLeftSliderButtonActive");
  }),
  setInterval(() => {
    selectTopNavLeftSliderItems.removeClass("topNavLeftSliderActive");
    $(".topNav_mid_left_slider_button").removeClass("topNavLeftSliderButtonActive");
    let newPosition = (++topNavLeftSliderItemPosition) % countTopNavLeftSliderItems;
    selectTopNavLeftSliderItems[newPosition].classList.add("topNavLeftSliderActive");
    $(".topNav_mid_left_slider_button")[newPosition].classList.add("topNavLeftSliderButtonActive");
  }, changeDuration),

  // 顶小轮播图渐变显隐效果 按钮以及自动播放 图片触碰改变透明度
  $(".topNav_mid_right_slider_prev").click(function() {
    selectTopNavRightSliderList.removeClass("topNavRightSliderActive");
    if (topNavRightSliderItemPosition <= 0) topNavRightSliderItemPosition += countTopNavRightSliderList;
    let newPosition = (--topNavRightSliderItemPosition) % countTopNavRightSliderList;
    selectTopNavRightSliderList[newPosition].classList.add("topNavRightSliderActive");
  }),
  $(".topNav_mid_right_slider_next").click(function() {
    selectTopNavRightSliderList.removeClass("topNavRightSliderActive");
    let newPosition = (++topNavRightSliderItemPosition) % countTopNavRightSliderList;
    selectTopNavRightSliderList[newPosition].classList.add("topNavRightSliderActive");
  }),
  setInterval(() => {
    selectTopNavRightSliderList.removeClass("topNavRightSliderActive");
    let newPosition = (++topNavRightSliderItemPosition) % countTopNavRightSliderList;
    selectTopNavRightSliderList[newPosition].classList.add("topNavRightSliderActive");
  }, changeDuration * 3),

  // 京东秒杀轮播图控制按钮按下时效果
  $(".secondKill_mid_slider_prev").click(function(e) {
    e.preventDefault();
    // 设定翻页动画时间
    if (parseInt($(".secondKill_mid_slider_list").css("left")) >= 0) {
      $(".secondKill_mid_slider_list").css("transition", "none");
      $(".secondKill_mid_slider_list").css("left", "-4000px");
      console.log($(".secondKill_mid_slider_list").css("left"));
    }
    $(".secondKill_mid_slider_list").css("transition", `.${secondKillMidAnimationDuration / 100}s ease`);
    $(".secondKill_mid_slider_list").css("left", `${parseInt($(".secondKill_mid_slider_list").css("left")) + 800}px`);
  }),

  $(".secondKill_mid_slider_next").click(function(e) {
    e.preventDefault();
    // 设定动画时间
    $(".secondKill_mid_slider_list").css("transition", `.${secondKillMidAnimationDuration / 100}s ease`);
    $(".secondKill_mid_slider_list").css("left", `${parseInt($(".secondKill_mid_slider_list").css("left")) - 800}px`);
    setTimeout(() => {
      if (parseInt($(".secondKill_mid_slider_list").css("left")) < -3200) {
        $(".secondKill_mid_slider_list").css("transition", "none");
        $(".secondKill_mid_slider_list").css("left", "0px");
      }
    }, secondKillMidAnimationDuration);
  }),

  // 京东秒杀右侧小轮播图自动轮播
  setInterval(() => {
    $(".secondKill_right_list").css("transition", `.${secondKillMidAnimationDuration / 100}s ease`);
    $(".secondKill_right_list").css("left", `${parseInt($(".secondKill_right_list").css("left")) - 180}px`);
    setTimeout(() => {
      if (parseInt($(".secondKill_right_list").css("left")) < -180) {
        $(".secondKill_right_list").css("transition", "none");
        $(".secondKill_right_list").css("left", "0px");
      }
    }, secondKillMidAnimationDuration);
  }, changeDuration),

  // 每日特价不同栏目修改内容
  $(".everydayDiscount_title_item").mouseenter(function() {
    $(".everydayDiscount_title_item").removeClass("everydayDiscountItemActive");
    $(this).addClass("everydayDiscountItemActive");
    let classIDName = $(this).attr("class").split(' ')[1];
    let objectName = eval(`everydayDiscountContainer.${classIDName}`);
    for (let i = 1; i <= Object.keys(objectName).length; i++) {
      $(".everydayDiscount_item_days")[i - 1].innerHTML = objectName[i][0] + "天最低价";
      $(".everydayDiscount_item_img")[i - 1].setAttribute("src", `../img/${classIDName + i}.jpg`)
      $(".everydayDiscount_item_information_title")[i - 1].innerHTML = objectName[i][1];
      $(".everydayDiscount_item_information_priceKill")[i - 1].innerHTML = objectName[i][2];
      $(".everydayDiscount_item_information_priceOrigin")[i - 1].innerHTML = objectName[i][3];
    }
  }),

  // 发现好物改图标
  $(".findGood_left_img").hover(function() {
    $(this).attr("src", "./img/findGoodLogo2.png")
  }, function() {
    $(this).attr("src", "./img/findGoodLogo1.png")
  }),

  // 为你推荐导航栏点击添加删除类名，创建列表子元素，显示下方列表，点击后页面显示区域跳转到为你推荐头部
  $(".recommendForYou_nav_item").click(function(e) {
    e.preventDefault();
    $(".recommendForYou_container_list > div").hide();
    $(".recommendForYou_nav_item").removeClass("recommendItemActive");
    let classIDName = this.className.split(" ")[1];
    $(`.${classIDName}`).addClass("recommendItemActive");
    $(`.recommendForYou_container_${classIDName}_list`).show();
    // 这个是获取recommendContainer的当前激活元素名称
    let objectName = eval(`recommendContainer.${classIDName}`);
    if (!$(`.recommendForYou_container_${classIDName}_list`).hasClass("hasChildren")) {
      for (let i = 0; i < Object.keys(objectName).length; i++) {
        $(`.recommendForYou_container_${classIDName}_list`).append(recommendForYouChildItem);
      }
      $(`.recommendForYou_container_${classIDName}_list`).addClass("hasChildren");
    }
    for (const key in objectName) {
      if (Object.hasOwnProperty.call(objectName, key)) {
        const element = objectName[key];
        $(`.recommendForYou_container_${classIDName}_list .recommendForYou_container_item_img`)[key - 1].setAttribute("src", `../img/${classIDName + key}.jpg`)
        $(`.recommendForYou_container_${classIDName}_list .recommendForYou_container_item_information_text`)[key - 1].innerHTML = element[0];
        $(`.recommendForYou_container_${classIDName}_list .recommendForYou_container_item_information_price`)[key - 1].innerHTML = element[1];
      }
    }
    $(html).animate({
      scrollTop: 2 * selectRecommendForYouContainer.offsetTop - selectRecommendForYouList.offsetTop
    }, 500);
  }),

  // 顶部右侧底部12格栏触碰更改显示图案
  $(".topNav_right_bottom_container_item").hover(function() {
    // over
    // 先获取触摸图片的图片编号
    let imgNumber = $(this).children(".topNav_right_bottom_container_item_img").attr("src").split("topNavRightItemImg")[1].split('.')[0];
    $(this).children(".topNav_right_bottom_container_item_img").attr("src", `./img/topNavRightItemImgHover${imgNumber}.png`);
  }, function() {
    // out
    let imgNumber = $(this).children(".topNav_right_bottom_container_item_img").attr("src").split("topNavRightItemImgHover")[1].split('.')[0];
    $(this).children(".topNav_right_bottom_container_item_img").attr("src", `./img/topNavRightItemImg${imgNumber}.png`);
  }),
  // 话费触摸显示块
  // 机票触摸显示块
  // 酒店触摸显示块
  // 游戏触摸显示块
  // 不写了，太繁琐的机械操作
);